---
kind: type
id: T:Autodesk.Revit.DB.SlabEdge
source: html/8c1ba09e-d1d0-b1e4-bc2f-26ec4b6c5afa.htm
---
# Autodesk.Revit.DB.SlabEdge

An object that represents a slab edge within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class SlabEdge : HostedSweep
```

## Remarks
This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.